Revit 2024 API
BuiltInFailures.CutFailures.CannotCutJoinedElement Property
 Can't cut joined element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCutJoinedElement { get; }
Visual Basic
Public Shared ReadOnly Property CannotCutJoinedElement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCutJoinedElement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace